tap "cantino/mcfly"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "act"
brew "ansible"
brew "awscli"
brew "bat"
brew "glib"
brew "cairo"
brew "cheat"
brew "circleci"
brew "coreutils"
brew "dep"
brew "diff-so-fancy"
brew "efm-langserver"
brew "exa"
brew "fd"
brew "gh"
brew "git"
brew "git-delta"
brew "glow"
brew "gnu-sed"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "gobject-introspection"
brew "golang-migrate"
brew "python@3.8"
brew "harfbuzz"
brew "pango"
brew "graphviz"
brew "htop"
brew "jq"
brew "k6"
brew "lastpass-cli"
brew "libpq", link: true
brew "n"
brew "neovim"
brew "ninja"
brew "nmap"
brew "openjdk"
brew "packer"
brew "pgcli"
brew "pup"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "speedtest-cli"
brew "task"
brew "terraform"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "xpdf"
brew "yarn-completion"
brew "cantino/mcfly/mcfly"
brew "hashicorp/tap/terraform-ls"
cask "alacritty"
cask "alfred"
cask "atom"
cask "brave-browser"
cask "charles"
cask "cyberduck"
cask "docker"
cask "firefox"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "github"
cask "google-chrome"
cask "hyper"
cask "istat-menus"
cask "iterm2"
cask "java"
cask "karabiner-elements"
cask "kindle"
cask "logitech-options"
cask "ngrok"
cask "paste"
cask "paw"
cask "postman"
cask "rectangle"
cask "slack"
cask "spotify"
cask "tableplus"
cask "vagrant"
cask "vanilla"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "viscosity"
cask "visual-studio-code"
cask "whatsapp"
cask "zoom"
cask "zsa-wally"
