tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "nlohmann/json"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Command-line interface for SQLite
brew "sqlite"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Modern replacement for 'ls'
brew "exa"
# Generic library support script
brew "libtool"
# Manage compile and link flags for libraries
brew "pkg-config"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Bash and zsh history suggest box
brew "hstr"
# Improved top (interactive process viewer)
brew "htop"
# Configurable static site generator
brew "hugo"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Utility to optimize JPEG files
brew "jpegoptim"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Postgres C API library
brew "libpq", link: true
# Port scanning utility for large networks
brew "nmap"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Readline wrapper: adds readline support to tools that lack it
brew "rlwrap"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command-line integration for Teensy USB development boards
brew "teensy_loader_cli"
# User interface to the TELNET protocol
brew "telnet"
# Tool to build, change, and version infrastructure
brew "terraform"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Packer
brew "hashicorp/tap/packer"
# Terraform Language Server
brew "hashicorp/tap/terraform-ls"
# GPU-accelerated terminal emulator
cask "alacritty"
# Open-source electronics prototyping platform
cask "arduino"
# Web browser focusing on privacy
cask "brave-browser"
cask "crosspack-avr"
# App to build and share containerized applications and microservices
cask "docker"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
cask "font-inconsolata-nerd-font-mono"
cask "font-mononoki-nerd-font-mono"
# 3D parametric modeler
cask "freecad"
# Web browser
cask "google-chrome"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customizer
cask "karabiner-elements"
# Clipboard manager
cask "maccy"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
cask "raspberry-pi-imager"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Native GUI tool for relational databases
cask "tableplus"
cask "teensy"
# Open-source BitTorrent client
cask "transmission"
cask "tunnelblick"
cask "tuntap"
# Free and open-source hosted hypervisor for x86 virtualization
cask "virtualbox"
# AMD64/Intel64 and x86 virtualization
cask "virtualbox-extension-pack"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
# Temporary makeshift alias for the video communication tool Zoom
cask "zoomus"
