altserver
arduino
atom
brave-browser
crosspack-avr
docker
epic-games
firefox
font-inconsolata-nerd-font-mono
font-mononoki-nerd-font-mono
freecad
google-chrome
hyper
istat-menus
iterm2
karabiner-elements
maccy
ngrok
raspberry-pi-imager
slack
spectacle
spotify
steam
tableplus
teensy
transmission
tunnelblick
tuntap
virtualbox
virtualbox-extension-pack
vlc
whatsapp
zoomus
